[
    {
      "id": 1,
      "questão": "Qual é a importância da heurística de forward checking na resolução de problemas de satisfação de restrições?",
      "A": "A heurística de forward checking garante a consistência arc em todos os arcos do problema.",
      "B": "A heurística de forward checking reduz o espaço de procura ao eliminar valores inconsistentes do domínio das variáveis, à medida que novas atribuições são feitas.",
      "C": "A heurística de forward checking aumenta o número de restrições a serem verificadas.",
      "D": "A heurística de forward checking não tem impacto na resolução de problemas de satisfação de restrições.",
      "resposta": "A heurística de forward checking reduz o espaço de procura ao eliminar valores inconsistentes do domínio das variáveis, à medida que novas atribuições são feitas."
    },
    {
      "id": 2,
      "questão": "Como a heurística de Minimum Remaining Values (MRV) pode ser útil na resolução de problemas de satisfação de restrições? ",
      "A": "A heurística MRV seleciona a variável mais restrita, o que reduz o espaço de procura.",
      "B": "A heurística MRV seleciona a variável com o maior domínio, o que aumenta o espaço de procura.",
      "C": "A heurística MRV seleciona a variável com o menor número de restrições, o que facilita a resolução do problema.",
      "D": "A heurística MRV não é relevante para problemas de satisfação de restrições.",
      "resposta": "A heurística MRV seleciona a variável mais restrita, o que reduz o espaço de procura."
    },
    {
      "id": 3,
      "questão": "Quais são as vantagens e desvantagens da abordagem de consistência de arco (arc consistency) na resolução de problemas de satisfação de restrições?",
      "A": "Vantagem: reduz o espaço de busca; Desvantagem: pode ser computacionalmente custoso.",
      "B": "Vantagem: garante a solução ótima; Desvantagem: não é eficiente para problemas grandes.",
      "C": "Vantagem: facilita a implementação de heurísticas; Desvantagem: não garante a consistência global.",
      "D": "Vantagem: elimina a necessidade de heurísticas; Desvantagem: não é eficaz para problemas complexos.",
      "resposta": "Vantagem: reduz o espaço de busca; Desvantagem: pode ser computacionalmente custoso."
    },
    {
      "id": 4,
      "questão": "O que é uma heurística no contexto do planeamento em inteligência artificial? ",
      "A": "Um algoritmo exato para resolver problemas de planeamento.",
      "B": "Uma função de avaliação que estima o custo de alcançar um determinado estado.",
      "C": "Um método para lidar com a incerteza nos resultados das ações.",
      "D": "Um operador lógico para representar relações entre variáveis no ambiente.",
      "resposta": "Uma função de avaliação que estima o custo de alcançar um determinado estado."
    },
    {
      "id": 5,
      "questão": "O que é um problema de planeamento com restrições temporais?",
      "A": "Um problema em que as ações devem ser executadas numa sequência específica.",
      "B": "Um problema em que as ações têm durações variáveis e dependências temporais.",
      "C": "Um problema em que as ações têm custos associados que variam ao longo do tempo.",
      "D": "Um problema em que as ações têm efeitos probabilísticos no ambiente.",
      "resposta": "Um problema em que as ações têm durações variáveis e dependências temporais."
    },
    {
      "id": 6,
      "questão": "Qual é o objetivo principal do algoritmo de procura informada A*?",
      "A": "Encontrar o caminho mais curto entre um ponto de partida e um ponto de destino, minimizando o custo total do caminho.",
      "B": "Maximizar o número de ações executadas.",
      "C": "Encontrar o caminho mais curto para o objetivo.",
      "D": "Explorar todas as possibilidades de ações.",
      "resposta": "Encontrar o caminho mais curto entre um ponto de partida e um ponto de destino, minimizando o custo total do caminho."
    },
    {
      "id": 7,
      "questão": "Em problemas de procura, o que é a função de custo?",
      "A": "Uma função que determina a probabilidade de sucesso de uma ação.",
      "B": "Uma função que atribui um custo às ações e estados do problema.",
      "C": "Uma função que indica a quantidade de recursos disponíveis para o agente.",
      "D": "Uma função que define o número de estados possíveis no problema.",
      "resposta": "Uma função que atribui um custo às ações e estados do problema."
    },
    {
      "id": 8,
      "questão": "O que significa dizer que um ambiente é parcialmente observável?",
      "A": "O agente não tem acesso a todas as informações do ambiente.",
      "B": "O ambiente está sempre em constante mudança.",
      "C": "O agente possui sensores de alta precisão.",
      "D": "O ambiente é determinístico.",
      "resposta": "O agente não tem acesso a todas as informações do ambiente."
    },
    {
      "id": 9,
      "questão": "Como é que a abordagem de aprendizagem por reforço pode ser aplicada na resolução de problemas em ambientes complexos?",
      "A": "Utilizando exemplos passados para orientar a solução de novos problemas semelhantes.",
      "B": "Criando modelos matemáticos precisos para representar o conhecimento do domínio.",
      "C": "Aprendendo a melhor estratégia de ação através da interação com o ambiente.",
      "D": "Aplicando técnicas de otimização para encontrar a solução mais eficiente.",
      "resposta": "Aprendendo a melhor estratégia de ação através da interação com o ambiente."
    },
    {
      "id": 10,
      "questão": "Quais são os principais desafios enfrentados na resolução de problemas em ambientes complexos que envolvem a tomada de decisões em tempo real?",
      "A": "Cooperação e competição entre os agentes.",
      "B": "Incerteza e imprecisão dos dados disponíveis.",
      "C": "Dificuldade em representar o conhecimento do domínio de forma adequada.",
      "D": "Falta de recursos computacionais para processar os dados em tempo hábil.",
      "resposta": "Incerteza e imprecisão dos dados disponíveis."
    }
  ]
  